NetSuiteWebhook/NetSuiteWebhook/Files/NS_FU/Fusion/ESSpayloads/REquest/SampleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/financials/commonModules/shared/model/erpIntegrationService/types/">
<soapenv:Header/>
<soapenv:Body>
<typ:submitESSJobRequest>
<typ:jobPackageName>/oracle/apps/ess/financials/receivables/transactions/autoInvoices</typ:jobPackageName>
<typ:jobDefinitionName>AutoInvoiceImportEss</typ:jobDefinitionName>
<!--Zero or more repetitions:-->
     <typ:paramList>300000002313021</typ:paramList>
     <typ:paramList>SIS_AR_IMPORT</typ:paramList>
	<typ:paramList>2021-03-26</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>	
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
	<typ:paramList>Y</typ:paramList>
	<typ:paramList>#NULL</typ:paramList>
</typ:submitESSJobRequest>
</soapenv:Body>
</soapenv:Envelope>